In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [2]:
df=pd.read_csv('dataset_group.csv')

In [3]:
df.head()

         Date  Order_id        Product
0  01-01-2018         1         yogurt
1  01-01-2018         1           pork
2  01-01-2018         1  sandwich bags
3  01-01-2018         1     lunch meat
4  01-01-2018         1   all- purpose

In [4]:
df.tail()

             Date  Order_id            Product
20636  25-02-2020      1138               soda
20637  25-02-2020      1138       paper towels
20638  26-02-2020      1139               soda
20639  26-02-2020      1139  laundry detergent
20640  26-02-2020      1139            shampoo

In [5]:
df1=df.copy()

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20641 entries, 0 to 20640
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20641 non-null  object
 1   Order_id  20641 non-null  int64
 2   Product   20641 non-null  object
dtypes: int64(1), object(2)
memory usage: 483.9+ KB

In [7]:
print('The numner of rows in the data set = ',df.shape[0])
print('The numner of columns in the data set = ',df.shape[1])

The numner of rows in the data set =  20641
The numner of columns in the data set =  3

In [8]:
round(df.describe().T,2)

            count    mean     std  min    25%    50%    75%     max
Order_id  20641.0  575.99  328.56  1.0  292.0  581.0  862.0  1139.0

In [9]:
df.describe(include='object').T

         count unique         top freq
Date     20641    603  08-02-2019  183
Product  20641     37     poultry  640

In [10]:
df.duplicated().sum()

4730

In [11]:
df.isnull().sum()

Date        0
Order_id    0
Product     0
dtype: int64